package module_07.TV

object Channel {
    private val mapChannels = mapOf<String, String>(
        "Всё ТВ" to "Описание канала \"Всё ТВ\"",
        "Первый канал" to "Описание канала \"Первый канал\"",
        "Россия 1" to "Описание канала \"Россия 1\"",
        "Матч ТВ" to "Описание канала \"Матч ТВ\"",
        "НТВ" to "Описание канала \"НТВ\"",
        "5 канал" to "Описание канала \"5 канал\"",
        "Россия К" to "Описание канала \"Россия К\"",
        "Россия 24" to "Описание канала \"Россия 24\"",
        "Карусель" to "Описание канала \"Карусель\"",
        "Общественное телевидение России" to "Описание канала \"Общественное телевидение России\"",
        "ТВ Центр" to "Описание канала \"ТВ Центр\"",
        "РЕН ТВ" to "Описание канала \"РЕН ТВ\"",
        "Спас" to "Описание канала \"Спас\"",
        "СТС" to "Описание канала \"СТС\"",
        "Домашний" to "Описание канала \"Домашний\"",
        "ТВ 3" to "Описание канала \"ТВ 3\"",
        "Телекомпания ПЯТНИЦА" to "Описание канала \"Телекомпания ПЯТНИЦА\"",
        "Звезда" to "Описание канала \"Звезда\"",
        "Мир" to "Описание канала \"Мир\"",
        "ТНТ" to "Описание канала \"ТНТ\"",
        "Муз ТВ" to "Описание канала \"Муз ТВ\"",
        "ОТВ (Миасс)" to "Описание канала \"ОТВ (Миасс)\"",
        "Русская линия (ранее 31 ТВК)" to "Описание канала \"Русская линия (ранее 31 ТВК)\"",
        "Че" to "Описание канала \"Че\"",
        "Shopping live" to "Описание канала \"Shopping live\"",
        "Телеканал «Известия» HD" to "Описание канала \"Телеканал «Известия» HD\"",
        "Shop&Show" to "Описание канала \"Shop&Show\"",
        "RTTV HD" to "Описание канала \"RTTV HD\"",
        "Ювелирочка" to "Описание канала \"Ювелирочка\"",
        "DW-TV" to "Описание канала \"DW-TV\"",
        "Ю" to "Описание канала \"Ю\"",
        "Евроновости" to "Описание канала \"Евроновости\"",
        "NHK WORLD-JAPAN" to "Описание канала \"NHK WORLD-JAPAN\"",
        "Leomax24" to "Описание канала \"Leomax24\"",
        "РБК-ТВ" to "Описание канала \"РБК-ТВ\"",
        "Мир 24" to "Описание канала \"Мир 24\"",
        "CNN International" to "Описание канала \"CNN International\"",
        "360" to "Описание канала \"360\"",
        "BBC World News" to "Описание канала \"BBC World News\"",
        "Большая Азия HD" to "Описание канала \"Большая Азия HD\"",
        "ВМЕСТЕ-РФ" to "Описание канала \"ВМЕСТЕ-РФ\"",
        "ЛДПР ТВ" to "Описание канала \"ЛДПР ТВ\"",
        "Красная Линия" to "Описание канала \"Красная Линия\"",
        "France 24" to "Описание канала \"France 24\""
    )

    fun getDescription(name: String): String{
        return mapChannels.getOrDefault(name,"Указанного \"$name\" канала нет в списке.")
    }

    fun getRandomChannels(countChannels: Int): List<String> {
        val listChannels = ArrayList(mapChannels.keys)
        val count: Int = if (countChannels >= 1) if (countChannels > listChannels.size) listChannels.size
        else countChannels else 0
        return listChannels.shuffled().slice(0 until count)
    }
}